app/views/surveys/_take_survey.html.erb

            <%= f.hidden_field :survey_id, :value => @survey.id %>
            <% questions.answers.each do |mco| %>
---
SELECT `answers`.* FROM `answers` WHERE (`answers`.question_id = 10)