app/views/surveys/show.html.erb

SELECT `questions`.* FROM `questions` WHERE (`questions`.survey_id = 1)
---

  <% @survey.questions.each do |q| %>