app/controllers/surveys_controller.rb

  def show
    @survey = Survey.find(params[:id])
    @survey_response = @survey.survey_responses.find(:all, :order => 'question_id, content')
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 1 LIMIT 1
SELECT `survey_responses`.* FROM `survey_responses` WHERE (`survey_responses`.survey_id = 3) ORDER BY question_id, content

  def edit
    @survey = Survey.find(params[:id])
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 4 LIMIT 1

  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save
---
INSERT INTO `surveys` (`user_id`, `updated_at`, `created_at`, `name`, `title`) VALUES (1, '2012-07-28 18:44:58', '2012-07-28 18:44:58', NULL, 'Awesome')

  def update
    @survey = Survey.find(params[:id])
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 4 LIMIT 1

  def take_survey_new
    @survey = Survey.find(params[:id])

    @survey.questions.count.times do
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 3 LIMIT 1
SELECT COUNT(*) FROM `questions` WHERE (`questions`.survey_id = 3)
SELECT `questions`.* FROM `questions` WHERE (`questions`.survey_id = 3)

  def take_survey_create
    survey_id = 0

    assoc_value = random_alphanumeric(21)
     params[:survey_responses].values.each do |a|
       a[:assoc_value] = assoc_value
       @survey_response = SurveyResponse.new(a)
       @survey_response.save if !a[:answer_id].blank?
---
INSERT INTO `survey_responses` (`updated_at`, `content`, `created_at`, `assoc_value`, `survey_id`, `answer_id`, `question_id`) VALUES ('2012-07-28 20:23:13', 'Anpother Answer', '2012-07-28 20:23:13', '1jrJXvTORN8kuuX562526', 5, 18, 10)

  def survey_answer

    if !params[:assoc_value].nil?
      @survey_responses = SurveyResponse.find(:all, :conditions => ['assoc_value = ?', params[:assoc_value]])
      total_score = 0
      @survey_responses.each do |ts|
        total_score = total_score + ts.answer.score
      end

      @final_answer = ScoreAnswer.find(:first, :conditions => ['survey_id = ? AND start_range <= ? AND (end_range >= ? OR end_range is NULL)', params[:survey_id], total_score, total_score]).content
---
SELECT `survey_responses`.* FROM `survey_responses` WHERE (assoc_value = '1TZbkna8A1KlthV871144')
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 18 LIMIT 1
SELECT `score_answers`.* FROM `score_answers` WHERE (survey_id = NULL AND start_range <= 38 AND (end_range >= 38 OR end_range is NULL)) LIMIT 1