app/controllers/users_controller.rb

SELECT COUNT(*) FROM `questions` WHERE (`questions`.survey_id = 5)
SELECT `questions`.* FROM `questions` WHERE (`questions`.survey_id = 5)
SELECT `surveys`.* FROM `surveys` ORDER BY surveys.id DESC LIMIT 1
---
  def home
    @survey = Survey.find(:last)

    @survey.questions.count.times do

INSERT INTO `users` (`updated_at`, `password_hash`, `password_salt`, `email`, `created_at`) VALUES ('2012-07-29 00:20:52', '$2a$10$ETZF8YARN.00soSMNhmF9eXC4.R7U5yiFj54C7UwllquFMWYXeJEa', '$2a$10$ETZF8YARN.00soSMNhmF9e', 'AwesomeMan@gmail.com', '2012-07-29 00:20:52')
---
  def create
    @user = User.new(params[:user])
    if @user.save